from selenium.webdriver.common.by import By

# Локаторы для первой карточки аккордеона
ACCORDION_1 = (By.ID, 'accordion__heading-0')
ANSWER_1 = (By.ID, 'accordion__panel-0')
DESCRIPTION_1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'

# Локаторы для второй карточки аккордеона
ACCORDION_2 = (By.ID, 'accordion__heading-1')
ANSWER_2 = (By.ID, 'accordion__panel-1')
DESCRIPTION_2 = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'

# Локаторы для третьей карточки аккордеона
ACCORDION_3 = (By.ID, 'accordion__heading-2')
ANSWER_3 = (By.ID, 'accordion__panel-2')
DESCRIPTION_3 = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'

# Локаторы для четвертой карточки аккордеона
ACCORDION_4 = (By.ID, 'accordion__heading-3')
ANSWER_4 = (By.ID, 'accordion__panel-3')
DESCRIPTION_4 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'

# Локаторы для пятой карточки аккордеона
ACCORDION_5 = (By.ID, 'accordion__heading-4')
ANSWER_5 = (By.ID, 'accordion__panel-4')
DESCRIPTION_5 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'

# Локаторы для шестой карточки аккордеона
ACCORDION_6 = (By.ID, 'accordion__heading-5')
ANSWER_6 = (By.ID, 'accordion__panel-5')
DESCRIPTION_6 = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'

# Локаторы для седьмой карточки аккордеона
ACCORDION_7 = (By.ID, 'accordion__heading-6')
ANSWER_7 = (By.ID, 'accordion__panel-6')
DESCRIPTION_7 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'

# Локаторы для восьмой карточки аккордеона
ACCORDION_8 = (By.ID, 'accordion__heading-7')
ANSWER_8 = (By.ID, 'accordion__panel-7')
DESCRIPTION_8 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
